In [1]:
from pathlib import Path
Path('my_data.db').touch()

In [2]:
import sqlite3
conn = sqlite3.connect('my_data.db')
c = conn.cursor()

In [3]:
c.execute('''CREATE TABLE users (user_id int, username text)''')

In [4]:
import pandas as pd
# load the data into a Pandas DataFrame
users = pd.read_csv('businesses.csv')
# write the data to a sqlite table
users.to_sql('businesses', conn, if_exists='append', index = False)

163

In [5]:
pd.read_sql('''

SELECT *
FROM businesses
WHERE year_founded < 999
ORDER BY year_founded

''', conn)

                      business  year_founded category_code country_code
0                   Kongō Gumi           578          CAT6          JPN
1  St. Peter Stifts Kulinarium           803          CAT4          AUT
2        Staffelter Hof Winery           862          CAT9          DEU
3            Monnaie de Paris            864         CAT12          FRA
4               The Royal Mint           886         CAT12          GBR
5                   Sean's Bar           900          CAT4          IRL

In [6]:
pd.read_sql('''

SELECT *
FROM businesses

''', conn)

                           business  year_founded category_code country_code
0                    Hamoud Boualem          1878         CAT11          DZA
1    Communauté Électrique du Bénin          1968         CAT10          BEN
2          Botswana Meat Commission          1965          CAT1          BWA
3                       Air Burkina          1967          CAT2          BFA
4                           Brarudi          1955          CAT9          BDI
..                              ...           ...           ...          ...
158                  Cafe Brasilero          1877          CAT4          URY
159                  Hacienda Chuao          1660         CAT11          VEN
160                  Australia Post          1809         CAT16          AUS
161             Bank of New Zealand          1861          CAT3          NZL
162          European Trust Company          1991          CAT3          VUT

[163 rows x 4 columns]